__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, 300)    0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, None, 300)    0                                            
__________________________________________________________________________________________________
model_1 (Model)                 (None, None, 200)    60200       input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
model_2 (Model)                 (None, None, 200)    80400       model_1[1][0]                    
                                                                 model_1[2][0]                    
__________________________________________________________________________________________________
permute_1 (Permute)             (None, 200, None)    0           model_2[2][0]                    
__________________________________________________________________________________________________
dot_1 (Dot)                     (None, None, None)   0           model_2[1][0]                    
                                                                 permute_1[0][0]                  
__________________________________________________________________________________________________
permute_2 (Permute)             (None, None, None)   0           dot_1[0][0]                      
__________________________________________________________________________________________________
masking2d_1 (Masking2D)         (None, None, None)   0           dot_1[0][0]                      
__________________________________________________________________________________________________
masking2d_2 (Masking2D)         (None, None, None)   0           permute_2[0][0]                  
__________________________________________________________________________________________________
softmax2d_1 (Softmax2D)         (None, None, None)   0           masking2d_1[0][0]                
__________________________________________________________________________________________________
softmax2d_2 (Softmax2D)         (None, None, None)   0           masking2d_2[0][0]                
__________________________________________________________________________________________________
dot_3 (Dot)                     (None, None, 200)    0           softmax2d_1[0][0]                
                                                                 model_1[2][0]                    
__________________________________________________________________________________________________
dot_2 (Dot)                     (None, None, 200)    0           softmax2d_2[0][0]                
                                                                 model_1[1][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, 400)    0           model_1[1][0]                    
                                                                 dot_3[0][0]                      
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, 400)    0           model_1[2][0]                    
                                                                 dot_2[0][0]                      
__________________________________________________________________________________________________
model_3 (Model)                 (None, None, 200)    120400      concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
masking_6 (Masking)             (None, None, 200)    0           model_3[1][0]                    
__________________________________________________________________________________________________
masking_7 (Masking)             (None, None, 200)    0           model_3[2][0]                    
__________________________________________________________________________________________________
masked_global_average_pooling1d (None, 200)          0           masking_6[0][0]                  
__________________________________________________________________________________________________
masked_global_average_pooling1d (None, 200)          0           masking_7[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 400)          0           masked_global_average_pooling1d_1
                                                                 masked_global_average_pooling1d_2
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          80200       concatenate_3[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 200)          40200       dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 3)            603         dense_2[0][0]                    
==================================================================================================
Total params: 382,003
Trainable params: 382,003
Non-trainable params: 0

Entrenamiento con el siguiente proceso
Corpus de TRAIN y DEV
4291/4291 [==============================] - 369s 86ms/step - loss: 0.3766 - acc: 0.8571 - val_loss: 0.4115 - val_acc: 0.8482

Posteriormente un TEST
Error			Accuracy
[0.4071071333019063, 0.84686279296875]
(16384, 3)
[[0.00616949 0.03424004 0.95959044]
 [0.05540321 0.8649235  0.07967331]
 [0.03203962 0.9395012  0.02845917]
 ...
 [0.04102453 0.84989136 0.10908409]
 [0.9711632  0.0275508  0.00128605]
 [0.9704005  0.0234011  0.00619837]]

Resultados con el TEST original (cruzado con los índices que tienen paráfraseo)
Este es el corpus BASE
TEST_new.csv
Resultados
[0.39720535595366296, 0.8507313829787234]
